Autodesk.Revit.DB.IFC.IFCRange.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCRange.End
The ending value of the range.
Since:
2013

Autodesk.Revit.DB.IFC.IFCRange.Start
The starting value of the range.
Since:
2013

Autodesk.Revit.DB.IFC.IFCRange.#ctor(Autodesk.Revit.DB.IFC.IFCRange)
Instantiates an IFCRange object by copy.
from:
The IFCRange object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCRange.#ctor(System.Double,System.Double)
Instantiates an IFCRange object.
start:
The starting value of the range.
end:
The ending value of the range.
Since:
2013

Autodesk.Revit.DB.IFC.IFCRange.#ctor
Instantiates a default IFCRange object.
Remarks:
The starting and ending value are both set to zero.
Since:
2013

Autodesk.Revit.DB.IFC.IFCRange
Typically for IFC export, this represents the lower and upper elevations for split wall and column geometry.
Remarks:
It contains two double values representing the starting and ending values as a range.
Since:
2013